{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Malware",
    "1": "O",
    "2": "B-Application",
    "3": "B-MalwareType",
    "4": "I-MalwareType",
    "5": "B-Person",
    "6": "I-Person",
    "7": "B-Organization",
    "8": "B-Time",
    "9": "I-Time",
    "10": "I-Application",
    "11": "B-OS",
    "12": "I-Organization",
    "13": "B-location",
    "14": "I-location",
    "15": "I-Malware",
    "16": "B-ThreatActor",
    "17": "I-ThreatActor",
    "18": "I-OS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Application": 2,
    "B-Malware": 0,
    "B-MalwareType": 3,
    "B-OS": 11,
    "B-Organization": 7,
    "B-Person": 5,
    "B-ThreatActor": 16,
    "B-Time": 8,
    "B-location": 13,
    "I-Application": 10,
    "I-Malware": 15,
    "I-MalwareType": 4,
    "I-OS": 18,
    "I-Organization": 12,
    "I-Person": 6,
    "I-ThreatActor": 17,
    "I-Time": 9,
    "I-location": 14,
    "O": 1
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
